//
//  Themes.swift
//  Memorize
//
//  Created by Nicholas Steven Bassett on 7/1/21.
//

import Foundation



struct Themes {
    
    let themeId: Int
    let theme: String 
    let emojiContent: [String]
    let cardPairCount: Int
    let themeColor: String
    
    

    
    static let vehicleEmojis = ["🚂","🚀","🚁","🚜", "🚘", "🚌", "🛵", "🏍", "🚍",
    "🚛", "🛴", "🚊", "🚢", "🛺", "🚑", "🚲", "🚒", "🚕", "🚞", "🚐",
    "🚗", "🛫", "🛩", "🚓"]
    
    static let animalEmoji = ["🐱","🐶","🐹","🐰","🐻","🐼","🐮","🐵","🙈","🐥","🐣","🦉","🐽","🐺","🦊","🐷","🐸","🐭","🦇","🦄","🐝","🐗","🐴"]
    static let bugEmojis =
        ["🐝","🪱", "🐛","🦋","🐌","🐞","🐜","🪰","🪲","🪳","🦟","🦗","🕷","🕸","🦂"]

    static let foodEmojis =
        ["🥮","🍱","🥟","🍙","🍦","🥧","🍿","🍰","🍨","🍚","🍢","🍡","🍧"]

    static let objectEmojis = ["🧯","📡","🪔","⚖️","📀","🕹","📱","⌚️","🪛","🔫","🗡","⚰️","📿","🔮","💊","🧽","💰","⏱"]
    
    static let seaLifeEmojis = [
        "🐙","🐡","🐟","🦐","🦑","🦞","🦀","🐬","🐳","🦈","🦭","🐋","🐠"]

    
    
}


